# FilterStringEndsWith Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterStringEndsWith Constructor
FilterStringEndsWith Class See Also
---
Constructs an instance of FilterStringEndsWith.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FilterStringEndsWith()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FilterStringEndsWith()
```

# See Also
FilterStringEndsWith Class
Autodesk.Revit.DB Namespace